app/controllers/school_classes_controller.rb

    def update
        @school_class.update(school_class_params(:title,:room_number))
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 89], ["updated_at", "2020-01-14 20:17:55.291768"], ["id", 1]]